{
  "title": "Kwanzaa",
  "description": "Happy_Kwanzaa With refugees in Uganda nakivale Camp. Kwanzaa is not a religious holiday but a cultural one, open to all who value its principles of unity, resilience, and collective progress. Let’s honor our history and build a better future together! 💚❤🖤. 𝗛𝗔𝗣𝗣𝗬 𝗞𝗪𝗔𝗡𝗭𝗔𝗔 ✨🕯 Kwanzaa is a beautiful week-long celebration that honors African heritage, culture, and community. 🌍 It was founded in 1966 by Dr. Maulana Karenga, a professor, author, and activist, during the Black Liberation Movement. His goal was to create a cultural holiday for Black Americans to reconnect with their African roots, foster unity, and celebrate collective identity. Kwanzaa is celebrated from December 26th to January 1st and each day is dedicated to one of the Nguzo Saba (the seven principles): 1⃣ Umoja (unity): Striving to achieve and maintain unity within family, community, and nation. 2⃣ Kujichagulia (Self-determination): Defining, naming, and creating for ourselves. 3⃣ Ujima (Collective work and responsibility): Building and solving problems together. 4⃣ Ujamaa (Cooperative economics): Supporting black businesses and sharing wealth. 5⃣ Nia (Purpose): Engaging in the collective calling of building and uplifting the community. 6⃣ Kuumba (Creativity): Using creativity to leave the community better than we found it. 7⃣ Imani (Faith): Believing in our people, our culture, and our future. A kinara, which contains seven candles (three red, three green, and one black), is lit each evening to reflect the principles. Celebrations include vibrant music, dance, art, storytelling, and traditional foods. Families also exchange meaningful gifts that reflect the values of Kwanzaa. 🎁 Kwanzaa is not a religious holiday but a cultural one, open to all who value its principles of unity, resilience, and collective progress. Let’s honor our history and build a better future together! 💚❤🖤 We will organize a ceremony around a fire on Saturday as a reminder of African culture."
}